# SteelElementModifiersWillBeIgnoredWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SteelElementsFailures..::..SteelElementModifiersWillBeIgnoredWarn Property
BuiltInFailures..::..SteelElementsFailures Class See Also
---
The copes and cuts (by face, with voids, by reference plane) of the element are no longer modifying the geometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SteelElementModifiersWillBeIgnoredWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElementModifiersWillBeIgnoredWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SteelElementModifiersWillBeIgnoredWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SteelElementsFailures Class
Autodesk.Revit.DB Namespace